## Analisis de Ventas

In [1]:
#fecha,producto,categoria,precio,cantidad,ciudad
#2025-01-01,Audifonos,Electronica,25.5,2,Quito
#2025-01-01,Mouse,Electronica,15.0,1,Guayaquil
#2025-01-02,Camiseta,Ropa,10.0,3,Quito
#2025-01-02,Pantalon,Ropa,20.0,1,Cuenca
#2025-01-03,Audifonos,Electronica,25.5,1,Quito

In [97]:
import numpy as np
import pandas as pd

In [51]:
df = pd.DataFrame({
    'fecha':['2025-01-01','2025-01-01','2025-01-02','2025-01-02','2025-01-03'],
    'producto':['Audifonos','Mouse','Camiseta','Pantalon','Audifonos'],
    'categoria':['Electronica','Electronica','Ropa','Ropa','Electronica'],
    'precio':[25.5,15.0,10.0,20.0,25.5],
    'cantidad':[2,1,3,1,1],
    'ciudad':['Quito','Guayaquil','Quito','Cuenca','Quito']
})

df['fecha'] = pd.to_datetime(df['fecha']) #ojo
df

       fecha   producto    categoria  precio  cantidad     ciudad
0 2025-01-01  Audifonos  Electronica    25.5         2      Quito
1 2025-01-01      Mouse  Electronica    15.0         1  Guayaquil
2 2025-01-02   Camiseta         Ropa    10.0         3      Quito
3 2025-01-02   Pantalon         Ropa    20.0         1     Cuenca
4 2025-01-03  Audifonos  Electronica    25.5         1      Quito

In [52]:
df[0:2]

       fecha   producto    categoria  precio  cantidad     ciudad
0 2025-01-01  Audifonos  Electronica    25.5         2      Quito
1 2025-01-01      Mouse  Electronica    15.0         1  Guayaquil

In [53]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   fecha      5 non-null      datetime64[ns]
 1   producto   5 non-null      object
 2   categoria  5 non-null      object
 3   precio     5 non-null      float64
 4   cantidad   5 non-null      int64
 5   ciudad     5 non-null      object
dtypes: datetime64[ns](1), float64(1), int64(1), object(3)
memory usage: 372.0+ bytes

In [54]:
df.isnull().sum()

fecha        0
producto     0
categoria    0
precio       0
cantidad     0
ciudad       0
dtype: int64

In [55]:
df['total_venta'] = df['precio'] * df['cantidad']
df

       fecha   producto    categoria  precio  cantidad     ciudad  total_venta
0 2025-01-01  Audifonos  Electronica    25.5         2      Quito         51.0
1 2025-01-01      Mouse  Electronica    15.0         1  Guayaquil         15.0
2 2025-01-02   Camiseta         Ropa    10.0         3      Quito         30.0
3 2025-01-02   Pantalon         Ropa    20.0         1     Cuenca         20.0
4 2025-01-03  Audifonos  Electronica    25.5         1      Quito         25.5

In [56]:
df.rename(columns={'fecha': 'tipo_fecha'}, inplace=True)
df

  tipo_fecha   producto    categoria  precio  cantidad     ciudad  total_venta
0 2025-01-01  Audifonos  Electronica    25.5         2      Quito         51.0
1 2025-01-01      Mouse  Electronica    15.0         1  Guayaquil         15.0
2 2025-01-02   Camiseta         Ropa    10.0         3      Quito         30.0
3 2025-01-02   Pantalon         Ropa    20.0         1     Cuenca         20.0
4 2025-01-03  Audifonos  Electronica    25.5         1      Quito         25.5

In [57]:
df1 = df['ciudad'] == 'Quito'
df[df1]

  tipo_fecha   producto    categoria  precio  cantidad ciudad  total_venta
0 2025-01-01  Audifonos  Electronica    25.5         2  Quito         51.0
2 2025-01-02   Camiseta         Ropa    10.0         3  Quito         30.0
4 2025-01-03  Audifonos  Electronica    25.5         1  Quito         25.5

In [58]:
df2 = df['categoria'] == 'Electronica'
df[df2]

  tipo_fecha   producto    categoria  precio  cantidad     ciudad  total_venta
0 2025-01-01  Audifonos  Electronica    25.5         2      Quito         51.0
1 2025-01-01      Mouse  Electronica    15.0         1  Guayaquil         15.0
4 2025-01-03  Audifonos  Electronica    25.5         1      Quito         25.5

In [64]:
df3 = df['total_venta'].sum()
df3

np.float64(141.5)

In [93]:
ingreso_por_ciudad = df.groupby('ciudad')['total_venta'].sum()
ingreso_por_ciudad

ciudad
Cuenca        20.0
Guayaquil     15.0
Quito        106.5
Name: total_venta, dtype: float64

In [96]:
ventas_producto = df.groupby('producto')['cantidad'].sum().sort_values(ascending=False)
ventas_producto

producto
Audifonos    3
Camiseta     3
Mouse        1
Pantalon     1
Name: cantidad, dtype: int64

In [91]:
precio_promedio = df.groupby('categoria')['precio'].mean()
precio_promedio

categoria
Electronica    22.0
Ropa           15.0
Name: precio, dtype: float64

In [105]:
tventas = df['total_venta'].to_numpy()
promedio = np.mean(tventas)
maximo = np.max(tventas)
desviacion = np.std(tventas, ddof=1)

print(f"Promedio: {promedio}")
print(f"Máximo: {maximo}")
print(f"Desviación estándar: {desviacion}")

Promedio: 28.3
Máximo: 51.0
Desviación estándar: 13.890644333507355